tutorials/pbeTransportFoam/oxidation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0.6364  0.6364  0.0)
    (-0.6364  0.6364  0.0)
    (-0.6364  -0.6364  0.0)
    (0.6364  -0.6364  0.0)
    (0.6364  0.6364  90.0)
    (-0.6364  0.6364  90.0)
    (-0.6364  -0.6364  90.0)
    (0.6364  -0.6364  90.0)
);

edges
(
    arc 0 1 (0.0 0.9 0.0)
    arc 1 2 (-0.9 0.0 0.0)
    arc 2 3 (0.0 -0.9 0.0)
    arc 3 0 (0.9 0.0 0.0)
    arc 4 5 (0.0 0.9 90.0)
    arc 5 6 (-0.9 0.0 90.0)
    arc 6 7 (0.0 -0.9 90.0)
    arc 7 4 (0.9 0.0 90.0)
);


blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 1000) simpleGrading (1 1 1)
);


boundary
(
    wall
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (0 4 5 1)
            (2 6 7 3)
            (1 5 6 2)
        );
    }
    fuel
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
