tutorials/pbeTransportFoam/oxidation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40000;
        startFace       279900;
    }
    fuel
    {
        type            patch;
        nFaces          100;
        startFace       319900;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       320000;
    }
)

// ************************************************************************* //
