tutorials/pbeTransportFoam/oxidation/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

blockMesh

decomposePar 
mpirun -np 4 pbeTransportFoam -parallel

runApplication reconstructPar -latestTime

# ----------------------------------------------------------------- end-of-file
